var fallwall_data = { "data" : [
		{ 0: "Eddie Wen", 				1: "大四生，目前正在極力減肥中希望能達到免役過輕der標準。", 2: "class_1" },
		{ 0: "好色龍", 					1: "[翻譯] 龍與地下城：豐乳丸<br/>http://hornydragon.blogspot.com/2015/01/boobs.html<br/>誰想得到這小小一顆藥丸除了讓奶子變大，<br/>居然還擁有讓好朋友撕破臉的能力。<br/>(記得看昨天的神串：你這天殺的死矮人！！！)<br/>晚點還會翻一串。我看晚點直接去新增個分類好了......", 2: "class_2" },
		{ 0: "ＬＥＧＯ", 					1: "週末夜<br/>電視配宵夜！<br/>Photo credit- Keith Goldman", 2: "class_3" },
		{ 0: "林建良", 					1: "請問為何我打/* */ 這個javascript 無法註釋掉程式馬?", 2: "class_4" },
		{ 0: "香港獨立媒體網", 			1: "【即時】遊行人士已遊行至兆萬中心對出，遊行人士多次高叫「支持梁振英登基，打倒習近平」，有遊行人士手持「香港民族論」，指此書為禁書，是黑五類，因此要聽從梁振英命令仔細研究及警惕。", 2: "class_5" },
		{ 0: "張懸 Deserts Xuan", 		1: "為呈現最佳的投影效果，高雄潮水箴言使用了全世界最亮(40000流明)的投影機，大家覺得效果如何呢？<br/>另外，因為新鮮的生啤會有泡泡很多的情況，所以剛開始時讓大家花了不少時間排隊，抱歉抱歉，現在進入中場，排隊的情況已經排解，歡迎大家可以找時間(記得帶著身份證)去裝裝喔。<br/>～by 管理員～", 2: "class_6" },
		{ 0: "The News Lens 關鍵評論網", 	1: "【奈及利亞也有恐怖攻擊，為什麼媒體不關注？】<br/>上週法國巴黎發生恐怖攻擊，同一段時間，奈及利亞一名約10歲女童全身綁的炸彈被引爆，在繁忙的市場中炸死了至少20人。在這個國家，2014 年4月有200名學齡女童被綁架。今年稍早，伊斯蘭恐怖組織博科聖地對一個村落波加發動攻擊，屠殺了兩千人。<br/>法國與奈及利亞都遭到伊斯蘭恐怖分子攻擊，這些攻擊都令人感到震驚與可怖，但許多人注意到：國際反應的程度卻大不相同。無可否認，西方對於發生在自己社會的現象，會投入較多的關注，但這似乎仍不能解釋如此巨大的差別待遇。", 2: "class_7" },
		{ 0: "陳孟謙", 					1: "應呂銓要求..<br/>小六畢業證件照<br/>頭太大已經塞滿整個版面了...", 2: "class_8" },
		{ 0: "黃豊元", 					1: "2015第一發就發廢文<br/>第一次玩到快要兩億<br/>太神啦RRR", 2: "class_9" },
		{ 0: "Shen Hister", 			1: "等到快餓昏的隊聚<br/>好不容易聚集那麼多人<br/>希望我們都能繼續走下去不會潰散<br/><br/>寒訓加油吧！！", 2: "class_10" },
		{ 0: "黑色島國青年陣線", 			1: "【自由幻夢：反新自由主義工作坊－倒數三天！】<br/>距離工作坊報名截止日期只剩下三天，<br/>還沒有報名的朋友們，準備好了嗎～？<br/>抓緊扶手，一起坐上反新自由主義列車囉！<br/>感謝 Appendectomy Project 割闌尾計畫 發炎人台北林先生<br/>來一起幫忙倒數！<br/>大家請記得：<br/>依法不得宣傳2/14是港湖區割闌尾罷免蔡正元公投<br/>依法不得宣傳2/14是港湖區割闌尾罷免蔡正元公投<br/>依法不得宣傳2/14是港湖區割闌尾罷免蔡正元公投<br/>因為很重要說三次！", 2: "class_11" }
	]};

$(document).ready( function(){

	$('.box').fallwall_init( $('.template').html(), {
		gridNumber: 4,
		columnNumber: 3,
		margin_left: '5px',
		margin_right: '5px'
	}, fallwall_data, function(){
		$('body h1').css( 'background-color', '#c0c0c0' );
	});

});

$(window).load( function(){

	$(window).scroll( function(){

		var scrollNow = $(window).scrollTop();
		if( scrollNow >= $('body').height() - $(window).height() -10 ) {
			$('.box').giveMeMore();
		}

	});

});

function more() {
	$('.box').addNewGrid( { "data": [
		{ 0: "黑色島國青年陣線", 1: "【自由幻夢：反新自由主義工作坊－倒數三天！】<br/>距離工作坊報名截止日期只剩下三天，<br/>還沒有報名的朋友們，準備好了嗎～？<br/>抓緊扶手，一起坐上反新自由主義列車囉！<br/>感謝 Appendectomy Project 割闌尾計畫 發炎人台北林先生<br/>來一起幫忙倒數！<br/>大家請記得：<br/>依法不得宣傳2/14是港湖區割闌尾罷免蔡正元公投<br/>依法不得宣傳2/14是港湖區割闌尾罷免蔡正元公投<br/>依法不得宣傳2/14是港湖區割闌尾罷免蔡正元公投<br/>因為很重要說三次！", 2: "class_beAdd" }
	]} );
}